#+TITLE: wolfram-mode

* wolfram-mode.el

Clone project into =source-dir= and configure =init.el=

#+begin_src elisp
(use-package wolfram-mode :ensure nil
  :load-path "source-dir"
  :mode ("\\.m\\'" . wolfram-mode)
  :init (setq wolfram-program "/usr/local/bin/math"
              wolfram-path "~/.WolframEngine/Applications")
  :config (lambda ()
            (require 'ob-wolfram)
            (org-babel-do-load-languages 'org-babel-load-languages
             (append org-babel-load-languages '((wolfram . t))))))
#+end_src

* ob-wolfram.el

Evaluate source blocks with =org babel=

#+begin_src wolfram :exports both
Solve[2x + 1 == 5, x]
#+end_src

#+RESULTS:
: {{x -> 2}}
